In [2]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [7]:
pd.DataFrame({"A":[1,2], "B":[3,4],"C":[5,6]},index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [12]:
pd.DataFrame([[1,2,3],[4,5,6]],range(1,3), columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [15]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [3]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [4]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [5]:
id()

'UWcau'

In [6]:
def score():
    return np.random.randint(0,100)

In [15]:
score()

66

In [19]:
_columns=["국어","수학","영어","사회","과학"]

In [20]:
_columns

['국어', '수학', '영어', '사회', '과학']

In [62]:
pd.DataFrame([[score() for i in range(5)]],[[id() for i in range(10)]], columns=_columns)

       국어  수학  영어  사회  과학
axUpc  77  62  85   1   5
tgFXK  77  62  85   1   5
jbfFO  77  62  85   1   5
PXEBj  77  62  85   1   5
PLOzf  77  62  85   1   5
QMixx  77  62  85   1   5
rPDLp  77  62  85   1   5
FFFRf  77  62  85   1   5
OkxVp  77  62  85   1   5
cDTbA  77  62  85   1   5

In [61]:
[id() for i in range(5)]

['qMPju', 'BsTSj', 'ARfTp', 'HLGvg', 'ICsKt']

In [63]:
[score() for i in range(5)]

[74, 18, 48, 40, 55]

In [64]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[id()])
for i in range(1,10):
    df.loc[id()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

       국어  영어  수학  사회
ehujO  31  33  71   6
Hrkjv  95  38  73  45
jwQUk  19  92  82  69
LMcuX  21  15  36  35
nvlVb  34  66  74  83
MmWpY  64   4  47  83
SjWcQ  85  32   0  41
PRKlc  64  46  43   9
BhAJq  32  63  29  67
FyXVO  53  60  70  14

In [65]:
pd.DataFrame(np.random.randint(0, 100, size=(10, 4)),
             index=list((''.join(random.choice(string.ascii_letters) for i in range(5))) for i in range(10)),
             columns=['국어', '영어', '수학', '사회']
            )

       국어  영어  수학  사회
CnNbr  66  36  96  56
eIDwv  70  55  94  16
FdMbP   1  49  61  21
OycZe  38  61  14  30
KgAaF  25  88  21  28
otGev  33  25  74  25
tuOAl  32  15  22  51
IORRG  43  43  41  57
loTmK  71   3  15  86
oipiG  64  19   4  61